### Manipulating Data

In [1]:
import pandas as pd
import numpy as np

Recall some aggregation functions we saw in NumPy:

In [2]:
m = np.array(
    [
        [1, 10, 100],
        [2, 20, 200],
        [3, 30, 300],
        [4, 40, 400]
    ]
)

We can calculate the mean for each column by specifying the axis as `0`:

In [3]:
np.mean(m, axis=0)

array([  2.5,  25. , 250. ])

Or we can calculate the mean of each row by specifying the axis as `1`:

In [4]:
np.mean(m, axis=1)

array([ 37.,  74., 111., 148.])

Those aggregate functions are also available as methods on the array:

In [5]:
m.mean(axis=0)

array([  2.5,  25. , 250. ])

In [6]:
m.mean(axis=1)

array([ 37.,  74., 111., 148.])

We have the same functionality available for DataFrames:

In [7]:
df = pd.DataFrame(
    m,
    index=['r0', 'r1', 'r2', 'r3'],
    columns=['c0', 'c1', 'c2']
)
df

    c0  c1   c2
r0   1  10  100
r1   2  20  200
r2   3  30  300
r3   4  40  400

In [8]:
df.mean(axis=0)

c0      2.5
c1     25.0
c2    250.0
dtype: float64

In [9]:
df.mean(axis=1)

r0     37.0
r1     74.0
r2    111.0
r3    148.0
dtype: float64

Or we can find the sum of all elements, row by row, or column by column:

In [10]:
df.sum(axis=0)

c0      10
c1     100
c2    1000
dtype: int64

In [11]:
df.sum(axis=1)

r0    111
r1    222
r2    333
r3    444
dtype: int64

The same works for functions such as `max`, `min`, `std`, `mean`, `count`, `prod`, `sum`, etc.

#### Vectorized Functions

Operating on `DataFrame` columns works very much the same way as with NumPy arrays - we use universal (or vectorized) functions.

In [12]:
df

    c0  c1   c2
r0   1  10  100
r1   2  20  200
r2   3  30  300
r3   4  40  400

In [13]:
df['c0'] + df['c1']

r0    11
r1    22
r2    33
r3    44
dtype: int64

Or, if we want to use `loc` and `iloc`:

In [14]:
df.loc[:, 'c0'] + df.iloc[:, 1]

r0    11
r1    22
r2    33
r3    44
dtype: int64

We can apply regular NumPy functions to entire `DataFrame` objects as well, just as with NumPy arrays:

In [15]:
np.sin(df)

          c0        c1        c2
r0  0.841471 -0.544021 -0.506366
r1  0.909297  0.912945 -0.873297
r2  0.141120 -0.988032 -0.999756
r3 -0.756802  0.745113 -0.850919

#### Transposing a DataFrame

One very useful function when working with data is transposing the data - i.e. turning the rows into columns and columns into rows.

As we've seen before, this can be done using the `transpose` method:

In [16]:
df

    c0  c1   c2
r0   1  10  100
r1   2  20  200
r2   3  30  300
r3   4  40  400

In [17]:
df.transpose()

     r0   r1   r2   r3
c0    1    2    3    4
c1   10   20   30   40
c2  100  200  300  400

#### Coercing a Series to a numeric type

Often we deal with datasets where columns may contain mostly numeric data, but a few values are not - maybe it's a missing value replaced with some string.

Let's see an example of this:

In [18]:
df = pd.read_csv('world_bank_countries.csv')
df[:5]

,CountryCode,ShortName,TableName,LongName,Alpha2Code,CurrencyUnit,SpecialNotes,Region,IncomeGroup,Wb2Code,...,GovernmentAccountingConcept,ImfDataDisseminationStandard,LatestPopulationCensus,LatestHouseholdSurvey,SourceOfMostRecentIncomeAndExpenditureData,VitalRegistrationComplete,LatestAgriculturalCensus,LatestIndustrialData,LatestTradeData,LatestWaterWithdrawalData
0,AFG,Afghanistan,Afghanistan,Islamic State of Afghanistan,AF,Afghan afghani,Fiscal year end: March 20; reporting period fo...,South Asia,Low income,AF,...,Consolidated central government,General Data Dissemination System (GDDS),1979,"Multiple Indicator Cluster Survey (MICS), 2010/11","Integrated household survey (IHS), 2008",NaN,2013/14,NaN,2013.0,2000.0
1,ALB,Albania,Albania,Republic of Albania,AL,Albanian lek,NaN,Europe & Central Asia,Upper middle income,AL,...,Budgetary central government,General Data Dissemination System (GDDS),2011,"Demographic and Health Survey (DHS), 2008/09",Living Standards Measurement Study Survey (LSM...,Yes,2012,2011.0,2013.0,2006.0
2,DZA,Algeria,Algeria,People's Democratic Republic of Algeria,DZ,Algerian dinar,NaN,Middle East & North Africa,Upper middle income,DZ,...,Budgetary central government,General Data Dissemination System (GDDS),2008,"Multiple Indicator Cluster Survey (MICS), 2012","Integrated household survey (IHS), 1995",NaN,NaN,2010.0,2013.0,2001.0
3,ASM,American Samoa,American Samoa,American Samoa,AS,U.S. dollar,NaN,East Asia & Pacific,Upper middle income,AS,...,NaN,NaN,2010,NaN,NaN,Yes,2007,NaN,NaN,NaN
4,ADO,Andorra,Andorra,Principality of Andorra,AD,Euro,NaN,Europe & Central Asia,High income: nonOECD,AD,...,NaN,NaN,2011. Population data compiled from administra...,NaN,NaN,Yes,NaN,NaN,2006.0,NaN

Let's look at the `LatestPopulationCensus` column:

In [19]:
df['LatestPopulationCensus'].unique()

array(['1979', '2011', '2008', '2010',
       '2011. Population data compiled from administrative registers.',
       '2014', nan, '2009', '2013', '2005', '2012', '2006', '2003',
       'Guernsey: 2009; Jersey: 2011.', '2007', '1984', '2002',
       '2006. Rolling census based on continuous sample survey.', '1997',
       '2004', '1943', '1993', '1998', '1987', '2001', '1989'],
      dtype=object)

As you can see, we have mostly integer values for the years, but some entries contain text - so we don't have a numeric column, as we can see by looking at the `info()` method:

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 247 entries, 0 to 246
Data columns (total 31 columns):
 #   Column                                      Non-Null Count  Dtype
---  ------                                      --------------  -----
 0   CountryCode                                 247 non-null    object
 1   ShortName                                   247 non-null    object
 2   TableName                                   247 non-null    object
 3   LongName                                    247 non-null    object
 4   Alpha2Code                                  244 non-null    object
 5   CurrencyUnit                                214 non-null    object
 6   SpecialNotes                                164 non-null    object
 7   Region                                      214 non-null    object
 8   IncomeGroup                                 214 non-null    object
 9   Wb2Code                                     246 non-null    object
 10  NationalAccountsBaseYear                    205 non-null    object
 11  NationalAccountsReferenceYear               54 non-null     object
 12  SnaPriceValuation                           198 non-null    object
 13  LendingCategory                             144 non-null    object
 14  OtherGroups                                 59 non-null     object
 15  SystemOfNationalAccounts                    214 non-null    object
 16  AlternativeConversionFactor                 47 non-null     object
 17  PppSurveyYear                               191 non-null    object
 18  BalanceOfPaymentsManualInUse                181 non-null    object
 19  ExternalDebtReportingStatus                 124 non-null    object
 20  SystemOfTrade                               200 non-null    object
 21  GovernmentAccountingConcept                 161 non-null    object
 22  ImfDataDisseminationStandard                183 non-null    object
 23  LatestPopulationCensus                      213 non-null    object
 24  LatestHouseholdSurvey                       147 non-null    object
 25  SourceOfMostRecentIncomeAndExpenditureData  158 non-null    object
 26  VitalRegistrationComplete                   112 non-null    object
 27  LatestAgriculturalCensus                    142 non-null    object
 28  LatestIndustrialData                        113 non-null    float64
 29  LatestTradeData                             186 non-null    float64
 30  LatestWaterWithdrawalData                   180 non-null    float64
dtypes: float64(3), object(28)
memory usage: 59.9+ KB

But let's say we do want to deal with this column as a numerical column - we'll have to drop the values which are not numerical of course, but that will still leave us some data to work with.

To do that, we can use the `to_numeric()` function to coerce the column into a numerical column.

If we attempt to just call this function on our column, by default we'll get an exception because some values (the strings) cannot be parsed to a numeric value:

In [21]:
try:
    pd.to_numeric(df['LatestPopulationCensus'])
except ValueError as ex:
    print('ValueError:', ex)

ValueError: Unable to parse string "2011. Population data compiled from administrative registers." at position 4

There's nothing we can do about this, however, we can choose to replace those values with `NaN` instead:

In [22]:
latest_census = pd.to_numeric(df['LatestPopulationCensus'], errors='coerce')
latest_census

0      1979.0
1      2011.0
2      2008.0
3      2010.0
4         NaN
        ...
242    2007.0
243       NaN
244    2004.0
245    2010.0
246    2012.0
Name: LatestPopulationCensus, Length: 247, dtype: float64

As you can see, the "bad" values have been converted to `NaN`, and the column is now a numeric.

In reality, those could be integers, not floats, and we can further manipulate this data to **downcast** the values to integers.

The problem is those `NaN` numbers which cannot be coerced into integers.

If we try using the `astype()` method:

In [23]:
try:
    latest_census.astype(int)
except ValueError as ex:
    print('ValueError:', ex)

ValueError: Cannot convert non-finite values (NA or inf) to integer

So, we have to drop these `NaN` values first, and then coerce to an integer type:

In [24]:
latest_census.dropna().astype(int)

0      1979
1      2011
2      2008
3      2010
5      2014
       ...
241    2010
242    2007
244    2004
245    2010
246    2012
Name: LatestPopulationCensus, Length: 208, dtype: int64

Another way to drop these null values is through a boolean mask that we've seen before:

In [25]:
latest_census[latest_census.notnull()].astype(int)

0      1979
1      2011
2      2008
3      2010
5      2014
       ...
241    2010
242    2007
244    2004
245    2010
246    2012
Name: LatestPopulationCensus, Length: 208, dtype: int64

#### Concatenating DataFrames

Often we want to build a new DataFrame object from series obtained elsewhere.

The tricky part of course, is the row index - row index labels do not have to match up when do this, but it will result in missing values where indices do not match.

Let's look at some simple examples first, using the `concat()` function:

In [26]:
df_1 = pd.DataFrame(
    [
        [1, 2, 3],
        [2, 3, 4]
    ],
    index = ['r1', 'r2'],
    columns = ['c1', 'c2', 'c3']
)

df_2 = pd.DataFrame(
    [
        [10, 20],
        [20, 30]
    ],
    index = ['r1', 'r2'],
    columns = ['c10', 'c20']
)

In [27]:
df_1

    c1  c2  c3
r1   1   2   3
r2   2   3   4

In [28]:
df_2

    c10  c20
r1   10   20
r2   20   30

We can concatenate these two frames, along the column axis (axis `1`), by using the `concat` function:

In [29]:
pd.concat([df_1, df_2], axis=1)

    c1  c2  c3  c10  c20
r1   1   2   3   10   20
r2   2   3   4   20   30

As you can see, the row indexes aligned with each other, but if our row index labels do not match up, here's what happens:

In [30]:
df_1 = pd.DataFrame(
    [
        [1, 2, 3],
        [2, 3, 4]
    ],
    index = ['r1', 'r2'],
    columns = ['c1', 'c2', 'c3']
)

df_2 = pd.DataFrame(
    [
        [10, 20],
        [20, 30]
    ],
    index = ['r10', 'r2'],
    columns = ['c10', 'c20']
)

In [31]:
pd.concat([df_1, df_2], axis=1)

      c1   c2   c3   c10   c20
r1   1.0  2.0  3.0   NaN   NaN
r2   2.0  3.0  4.0  20.0  30.0
r10  NaN  NaN  NaN  10.0  20.0

As you can see, our resulting frame now has `3` rows, and `NaN` values are now present for the "misaligned" rows.

If we have "duplicate" column labels, this is perfectly fine, except that our resulting column index labels will have repeated values:

In [32]:
df_1 = pd.DataFrame(
    [
        [1, 2, 3],
        [2, 3, 4]
    ],
    index = ['r1', 'r2'],
    columns = ['c1', 'c2', 'c3']
)

df_2 = pd.DataFrame(
    [
        [10, 20],
        [20, 30]
    ],
    index = ['r1', 'r2'],
    columns = ['c1', 'c20']
)

pd.concat([df_1, df_2], axis=1)

    c1  c2  c3  c1  c20
r1   1   2   3  10   20
r2   2   3   4  20   30

Of course, we can always replace the column index labels - here I'll show you another way of doing this (we saw the `rename` method earlier) - in parituclar because we have a repeated label `c1`, so using a dictionary mapping old name to new name is not going to work.

All we have do to, is set the `columns` (index) property using a list of the new column labels:

In [33]:
data = pd.concat([df_1, df_2], axis=1)
data.columns = ['c1', 'c2', 'c3', 'c4', 'c5']
data

    c1  c2  c3  c4  c5
r1   1   2   3  10  20
r2   2   3   4  20  30

We can also concatenate rows, and behaves similarly to column concatenation.

In [34]:
df_1 = pd.DataFrame(
    [
        [1, 2, 3],
        [2, 3, 4]
    ],
    index = ['r1', 'r2'],
    columns = ['c1', 'c2', 'c3']
)

df_2 = pd.DataFrame(
    [
        [10, 20],
        [20, 30]
    ],
    index = ['r3', 'r4'],
    columns = ['c3', 'c4']
)

In [35]:
pd.concat([df_1, df_2], axis=0)

     c1   c2  c3    c4
r1  1.0  2.0   3   NaN
r2  2.0  3.0   4   NaN
r3  NaN  NaN  10  20.0
r4  NaN  NaN  20  30.0

Now let's go back to our `world_bank_countries.csv` example.

We left off having extracted a single column `LatestPopulationCensus` and cleaned it up by removing non numerical values:

In [36]:
latest_census = latest_census[latest_census.notnull()].astype(int)
latest_census

0      1979
1      2011
2      2008
3      2010
5      2014
       ...
241    2010
242    2007
244    2004
245    2010
246    2012
Name: LatestPopulationCensus, Length: 208, dtype: int64

What we want to do now is extract a subset of columns, and use the modified `latest_census` series to replace the original column.

First let's see the column subset:

In [37]:
subset = df.loc[:, ['CountryCode', 'ShortName']]
subset.loc[:5]

  CountryCode       ShortName
0         AFG     Afghanistan
1         ALB         Albania
2         DZA         Algeria
3         ASM  American Samoa
4         ADO         Andorra
5         AGO          Angola

You'll notice that our explicit index was automatically created when we created the data frame. (It was based on a positional index, but it is still an explicit index - so even if we shuffle rows around, those index labels are maintained):

In [38]:
subset.sort_values('CountryCode', ascending=False)

    CountryCode        ShortName
246         ZWE         Zimbabwe
245         ZMB           Zambia
54          ZAR  Dem. Rep. Congo
199         ZAF     South Africa
244         YEM            Yemen
..          ...              ...
1           ALB          Albania
5           AGO           Angola
0           AFG      Afghanistan
4           ADO          Andorra
10          ABW            Aruba

[247 rows x 2 columns]

And when we built up our new column, the explicit index was maintained too:

In [39]:
latest_census

0      1979
1      2011
2      2008
3      2010
5      2014
       ...
241    2010
242    2007
244    2004
245    2010
246    2012
Name: LatestPopulationCensus, Length: 208, dtype: int64

This means that we can now concatenate these two along the column axis, and the explicit index labels will match up, except where we have missing ones in `latest_census`:

In [40]:
pd.concat(
    [subset, latest_census],
    axis=1
).info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 247 entries, 0 to 246
Data columns (total 3 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   CountryCode             247 non-null    object
 1   ShortName               247 non-null    object
 2   LatestPopulationCensus  208 non-null    float64
dtypes: float64(1), object(2)
memory usage: 7.7+ KB

The problem is that our `latest_census` column turned back into a float!

The reason of course, is that we have `NaN` values for the missing data.

There's two ways to fix this.

The first way is to use a mask to remove the rows with missing data from `subset`, and then concatenating with the `latest_census` series:

In [41]:
df = pd.read_csv('world_bank_countries.csv')
latest_census = pd.to_numeric(df['LatestPopulationCensus'], errors='coerce')
subset = df.loc[latest_census.notnull(), ['CountryCode', 'ShortName']]
subset

    CountryCode           ShortName
0           AFG         Afghanistan
1           ALB             Albania
2           DZA             Algeria
3           ASM      American Samoa
5           AGO              Angola
..          ...                 ...
241         VIR      Virgin Islands
242         WBG  West Bank and Gaza
244         YEM               Yemen
245         ZMB              Zambia
246         ZWE            Zimbabwe

[208 rows x 2 columns]

In [42]:
result = pd.concat([subset, latest_census.dropna().astype(int)], axis=1)
result

    CountryCode           ShortName  LatestPopulationCensus
0           AFG         Afghanistan                    1979
1           ALB             Albania                    2011
2           DZA             Algeria                    2008
3           ASM      American Samoa                    2010
5           AGO              Angola                    2014
..          ...                 ...                     ...
241         VIR      Virgin Islands                    2010
242         WBG  West Bank and Gaza                    2007
244         YEM               Yemen                    2004
245         ZMB              Zambia                    2010
246         ZWE            Zimbabwe                    2012

[208 rows x 3 columns]

The other method is to use the `join` argument of the concat method.

the default value for this argument is `outer` which means that column values not matching up on the row index are replaced by `NaN` - what we've seen so far.

The other value for this argument is `inner` - in which case it will drop rows that have mismatched indices - so we'll end up with less rows, but no null values.

In [43]:
df = pd.read_csv('world_bank_countries.csv')
latest_census = pd.to_numeric(df['LatestPopulationCensus'], errors='coerce')
latest_census = latest_census.dropna().astype(int)
subset = df[['CountryCode', 'ShortName']]

In [44]:
latest_census

0      1979
1      2011
2      2008
3      2010
5      2014
       ...
241    2010
242    2007
244    2004
245    2010
246    2012
Name: LatestPopulationCensus, Length: 208, dtype: int64

In [45]:
subset

    CountryCode           ShortName
0           AFG         Afghanistan
1           ALB             Albania
2           DZA             Algeria
3           ASM      American Samoa
4           ADO             Andorra
..          ...                 ...
242         WBG  West Bank and Gaza
243         WLD               World
244         YEM               Yemen
245         ZMB              Zambia
246         ZWE            Zimbabwe

[247 rows x 2 columns]

As you can see we have less rows in `latest_census` than we do in `subset` - i.e. `latest_census` contains a subset of the explicit row indices of `subset`.

We can now join (along the columns axis), using an `inner` join:

In [46]:
pd.concat([subset, latest_census], axis=1, join='inner')

    CountryCode           ShortName  LatestPopulationCensus
0           AFG         Afghanistan                    1979
1           ALB             Albania                    2011
2           DZA             Algeria                    2008
3           ASM      American Samoa                    2010
5           AGO              Angola                    2014
..          ...                 ...                     ...
241         VIR      Virgin Islands                    2010
242         WBG  West Bank and Gaza                    2007
244         YEM               Yemen                    2004
245         ZMB              Zambia                    2010
246         ZWE            Zimbabwe                    2012

[208 rows x 3 columns]